# -*- coding: utf-8 -*-
"""Копия блокнота "if_upd.ipynb"

Automatically generated by Colab.

Original file is located at
    https://colab.research.google.com/drive/1Rrzk_D3RNQadhOf3pNk_klNojE1Cy0Pw

# Условия в Python

## Теория: расширенные возможности условий

### 1. Тернарный оператор

Компактная запись простых условий:

```python
переменная = значение_если_истина if условие else значение_если_ложь
```

**Пример:**
```python
age = 20
status = "взрослый" if age >= 18 else "ребенок"
print(status)  # взрослый
```

### 2. Вложенные условия

Условия внутри других условий:

```python
if условие1:
    if условие2:
        # код
    else:
        # код
else:
    # код
```

### 3. Функции isinstance() и any()

**isinstance()** - проверяет тип объекта:
```python
isinstance(переменная, тип)
```

*Пример:*

```python
variable = '10'

isinstance(variable, int) # False
isinstance(variable, str) # True
```

Можно указать несколько типов, например, числа, которые могут быть как `int`, так и `float`, мы проверяем так:

```python
isinstance(number, (int, float))
```

**any()** - возвращает True если хотя бы один элемент итерируемого объекта истинный:
```python
any([False, True, False])  # True
```

# Блок 1: задачи на условия

## Задание 1

### Напишите программу для проверки пароля пользователя

**Образец работы программы:**

```
Введите пароль: 123
Пароль неверный
Введите пароль: 321
Пароль верный
```

**Алгоритм:**

1. Создайте переменную, в которой хранится верный пароль
2. Запросите у пользователя пароль
3. Если пароль верный, выведите "Пароль верный"
4. Иначе, выведите "Пароль неверный"
"""

### ваш код здесь ###
correct_password = '321'
is_correct = 'Пароль верный' if input('Введите пароль: ') == correct_password else 'Пароль неверный'
print(is_correct)

"""## Задание 2

### Напишите программу для проверки возраста пользователя с использованием тернарного оператора

**Образец работы программы:**

```
Введите возраст: 12
Доступ запрещен
Введите возраст: 21
Доступ разрешен
```

**Задача:** Напишите код с использованием тернарного оператора
"""

### ваш код здесь ###
age = 18
adult = 'Доступ разрешен' if int(input('Введите возраст')) >= age else 'Доступ запрещен'
print(adult)

"""## Задание 3

### Напишите программу для приветствия пользователя с вложенными условиями

**Образец работы программы:**

```
Введите время: 12:30
Добрый день!
Введите время: 10:30
Доброе утро!
Введите время: 21:30
Добрый вечер!
Введите время: 01:30
Доброй ночи!
```

**Задача:** Используйте вложенные условия вместо цепочки elif
"""

### ваш код здесь ###
time = input('Введите время:')
hours = int(time[0:2])

if 5 <= hours < 12:
    print('Доброе утро!')
else:
    if 12 <= hours < 18:
        print('Добрый день!')
    else:
        if 18 <= hours < 23:
            print('Добрый вечер!')
        else:
            print("Доброй ночи!")

"""## Задание 4

### Умный калькулятор с проверкой типов

**Образец работы программы:**

```
Введите выражение: 2 + 2
4
Введите выражение: 2 == 2
True
Введите выражение: 2 + 2.1
4.1
Введите выражение: abc + 2
Ошибка: неверный формат чисел
```

**Задача:** Добавьте проверку типов с помощью isinstance
"""

### ваш код здесь ###

"""## Задание 5

### Проверка сложного пароля с any()

**Образец работы программы:**

```
Введите пароль: abc
Пароль слишком простой
Введите пароль: abc123
Пароль принят!
```

**Условия:** Пароль должен содержать хотя бы одну цифру

**Задача:** Используйте any() для проверки наличия цифр в пароле
"""

### ваш код здесь ###
password = input('Введите пароль')
if any(i in '1234567890' for i in password):
     print('Пароль принят')
else:
     print('Пароль слишком простой')

"""# Блок 2: задачи на обработку данных

## Задание 6

### Фильтрация данных с any()

**Образец результата работы программы:**

```
Laptop
Smartphone
Tablet
```

**Условия:**

Дан список продуктов в магазине техники:

`["Laptop True", "Headphones False", "Smartphone True", "Tablet True", "Speaker False"]`

**Задача:** Используйте any() для проверки, есть ли в магазине хотя бы один продукт в наличии
"""

# Список продуктов
products = ["Laptop True", "Headphones False", "Smartphone True", "Tablet True", "Speaker False"]

# Проверяем, есть ли хотя бы один продукт в наличии
### ваш код здесь ###
available = any('True' in product for product in products)
# Выводим продукты в наличии
### ваш код здесь ###
if available:
     for product in products:
          if 'True' in product:
               print(product.split()[0])
else:
               print('Ничего нет')
"""## Задание 7

### Фильтрация по сложному условию

**Образец результата работы программы:**

```
Товары с количеством от 10 до 40:
Headphones 12
Tablet 10
```

**Условия:**

Дан список продуктов:

`["Laptop 8", "Headphones 12", "Smartphone 41", "Tablet 10", "Speaker 6"]`

**Задача:** Найдите товары с количеством от 10 до 40 включительно
"""

num_products = ["Laptop 8", "Headphones 12", "Smartphone 41", "Tablet 10", "Speaker 6"]

print("Товары с количеством от 10 до 40:")
# Для каждого продукта
for product in num_products:
    ### ваш код здесь ###
    name = product.split()[0]
    quantity = product.split()[1]
    if 10 <= int(quantity) <= 40:
          print(product)
    # Создаем переменные name и quantity с помощью split()
    # Проверяем количество (от 10 до 40)
    # Выводим на экран название продукта и его количество

"""## Задание 8

### Обработка данных с проверкой типов

**Образец результата работы программы:**

```
Числа: [1, 3, 4, 16]
Строки: ['Mouse', 'Keyboard']
```

**Условия:**

Дан список разных данных:

`["Desktop", 16, "Mouse", 2, "Keyboard", 4, 1, 3]`

**Задача:** Разделите данные на числа и строки с помощью isinstance()
"""

mixed_data = ["Desktop", 16, "Mouse", 2, "Keyboard", 4, 1, 3]

numbers = []
strings = []

# Для каждого объекта в mixed_data
for item in mixed_data:
    ### ваш код здесь ###
    if isinstance(item, int):
    # Если является числом, то
        numbers.append(item) # вносим в список numbers
    ### ваш код здесь ###
    if isinstance(item, str):
    # Если является строкой, то
        strings.append(item) # вносим в список strings

print(f"Числа: {sorted(numbers)}")  # сортирует по возрастанию
print(f"Строки: {sorted(strings)}") # сортирует по алфавиту

"""## Задание 9

### Сложная фильтрация с any() и all()

**Образец результата работы программы:**

```
Студенты, сдавшие все экзамены: ['Alice', 'Charlie']
Студенты, сдавшие хотя бы один экзамен: ['Alice', 'Bob', 'Charlie']
```

**Условия:**

Дан словарь с результатами экзаменов:

```python
students = {
    "Alice": [True, True, True],
    "Bob": [False, True, False],
    "Charlie": [True, True, True],
    "David": [False, False, False]
}
```

**Задача:** Используйте any() и all() для фильтрации
"""

students = {
    "Alice": [True, True, True],
    "Bob": [False, True, False],
    "Charlie": [True, True, True],
    "David": [False, False, False]
}

# Студенты, сдавшие все экзамены
passed_all = []
for name, results in students.items():
    ### ваш код здесь ###
    if all(results):
    # Проверяем, что всё было сдано
        passed_all.append(name)

# Студенты, сдавшие хотя бы один экзамен
passed_any = []
for name, results in students.items():
    ### ваш код здесь ###
    # Проверяем, что хотя бы одно было сдано
    if any(results):
        passed_any.append(name)

print(f"Студенты, сдавшие все экзамены: {passed_all}")
print(f"Студенты, сдавшие хотя бы один экзамен: {passed_any}")

"""## Задание 10

### Комплексная задача: система валидации данных

**Образец результата работы программы:**

```
Валидные пользователи: ['user1', 'user3']
Невалидные пользователи: ['user2']
```

**Условия:**

Дан список пользователей с данными:

```python
users = [
    {"username": "user1", "age": 25, "email": "user1@example.com", "active": True},
    {"username": "user2", "age": 15, "email": "invalid_email", "active": True},
    {"username": "user3", "age": 30, "email": "user3@example.com", "active": False}
]
```

**Критерии валидности:**
- Возраст >= 18
- Email содержит '@'
- Активен (active = True)

**Задача:** Используйте all() и any() для проверки условий
"""

users = [
    {"username": "user1", "age": 25, "email": "user1@example.com", "active": True},
    {"username": "user2", "age": 15, "email": "invalid_email", "active": True},
    {"username": "user3", "age": 30, "email": "user3@example.com", "active": False}
]

valid_users = []
invalid_users = []

for user in users:
    ### ваш код здесь ###
    # Прописываем условия
    is_age_legal = True if user['age'] >= 18 else False
    has_at_sign = True if '@' in user['email'] else False
    # Проверяем все условия с помощью all()
    if all([is_age_legal, has_at_sign, user['active']]):
    # Если всё возвращает значение true, то:
        valid_users.append(user["username"]) # Обновляем список пользователей,
                                             # которые успешно прошли валидацию
    else:
    # Иначе:
        invalid_users.append(user["username"]) # Обновляем список пользователей,
                                               # которые не прошли валидацию (наверняка они боты!)

print(f"Валидные пользователи: {valid_users}")
print(f"Невалидные пользователи: {invalid_users}")

"""## Дополнительная задача повышенной сложности

### Система оценки студентов

**Задача:** Напишите программу, которая:
1. Принимает оценки студента по разным предметам
2. Определяет статус студента
3. Использует тернарные операторы, any/all, isinstance

**Критерии:**
- Отличник: все оценки >= 4.5
- Хорошист: все оценки >= 3.5 и хотя бы одна >= 4.5
- Троечник: все оценки >= 3
- Неуспевающий: есть оценки < 3
"""

def evaluate_student(grades):
    """
    Оценивает статус студента на основе оценок
    """
    # Проверяем, что все элементы - числа
    ### ваш код здесь ###
if all(isinstance(grade, (int, float)) for grade in grades):
    # Определяем статус с помощью условий
    status = 'Отличник' if all(grade >= 4.5 for grade in grades) else '\n' 'Хорошист' if any(grade >= 4.5 for grade in grades) else '\n' 'Троечник' if all(grade >= 3 for grade in grades) else '\n' 'Неуспевающий'
else:
    print('Неверный тип данных')
    return 'Ошибка: неверный тип данных'
    ### ваш код здесь ###

    # NB! Используйтте название переменной status для результата
    return status

# Тестируем
test_grades = [
    [5, 5, 5],      # Отличник
    [4, 5, 4],      # Хорошист
    [3, 3, 4],      # Троечник
    [2, 4, 3],      # Неуспевающий
    [4.5, 4.5, 4.5] # Отличник
]

for grades in test_grades:
    result = evaluate_student(grades)
    print(f"Оценки: {grades} -> {result}")